r4d10n/hx-esp32-cam-fpv/esp32-psram-test/sdkconfig.defaults
# ESP32-S3 PSRAM Test Configuration

# Target
CONFIG_IDF_TARGET="esp32s3"

# PSRAM Configuration (2MB embedded, Quad SPI mode - AP_3v3)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_QUAD=y
CONFIG_SPIRAM_SPEED_80M=y

# Allow malloc to use PSRAM
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768

# Console on USB Serial JTAG (for easy monitoring)
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# Compiler optimizations
CONFIG_COMPILER_OPTIMIZATION_PERF=y
